In [1]:
#standard import when using pandas and numpy
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## CSV

In [2]:
#first we write into a csv

#we create dummy data first
data = {'Name' : ['Eddie', 'Ken', 'Madie'],
        'Gender': ['M', 'M', 'F']}

my_dframe = DataFrame(data)

my_dframe

    Name Gender
0  Eddie      M
1    Ken      M
2  Madie      F

In [3]:
#to Write to csv
my_dframe.to_csv('people.csv')
#if you don't specify a path it will be written where the notebook is

In [7]:
#now let's try to read from the csv we just created and modify
#first we try to read 2 lines
pd.read_csv('people.csv',header=None, nrows=2, sep=',')

     0      1       2
0  NaN   Name  Gender
1  0.0  Eddie       M

In [10]:
#now let's add a column to our dframe and write with a diffrent delimeter
my_dframe['Age'] = [10,20,15]

my_dframe

    Name Gender  Age
0  Eddie      M   10
1    Ken      M   20
2  Madie      F   15

In [11]:
# to see what we are writing we can use the sys module

import sys

my_dframe.to_csv(sys.stdout,sep='*')
#this is for you to check first before writing into a csv....Put path incase you want to write

*Name*Gender*Age
0*Eddie*M*10
1*Ken*M*20
2*Madie*F*15

In [16]:
#can also choose what columns to write:
my_dframe.to_csv(sys.stdout,columns=['Name','Age'], sep='-')

-Name-Age
0-Eddie-10
1-Ken-20
2-Madie-15

## JSON

In [17]:
#now We try JSON
# Heres an example of what a JSON (JavaScript Object Notation) looks like:
json_obj = """
{   "zoo_animal": "Lion",
    "food": ["Meat", "Veggies", "Honey"],
    "fur": "Golden",
    "clothes": null, 
    "diet": [{"zoo_animal": "Gazelle", "food":"grass", "fur": "Brown"}]
}
"""

In [19]:
#Let import json module
import json

#Lets load json data
data = json.loads(json_obj)

data

{'zoo_animal': 'Lion',
 'food': ['Meat', 'Veggies', 'Honey'],
 'fur': 'Golden',
 'clothes': None,
 'diet': [{'zoo_animal': 'Gazelle', 'food': 'grass', 'fur': 'Brown'}]}

In [20]:
#to convert back to JSON
json.dumps(data)

'{"zoo_animal": "Lion", "food": ["Meat", "Veggies", "Honey"], "fur": "Golden", "clothes": null, "diet": [{"zoo_animal": "Gazelle", "food": "grass", "fur": "Brown"}]}'

In [29]:
#open JSON data after loading with a DataFrame
dframe = DataFrame(data['food'])

dframe

         0
0     Meat
1  Veggies
2    Honey

## EXCEL

In [ ]:
"""
IMPORTANT NOTE: NEED TO HAVE xlrd AND openpyxl INSTALLED!!!
"""

In [32]:
my_xls= pd.ExcelFile('xls_rw_test.xlsx')

my_xls

In [34]:
my_dframe = my_xls.parse('Sheet1')

my_dframe

   This is a test  Unnamed: 1  Unnamed: 2
0              23        6678         456
1             234         678         456
2             234           7         345
3              34          56         234
4               5         456        4365